[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Censureer Afbeelding",
      "Decensureer Afbeelding",
      "Een programma dat afbeeldingen kan censureeren, met de originele afbeelding verborgen binenin.",
      "Gebruik de censureerder om je afbeelding te maken, voeg een wachtwoord toe, en klaar.",
      "Om te decensureeren, selecteer de afbeelding, geef het wachtwoord in en voila, censuurwetten omzeild in steil.",
      "Al dit is gedaan in de browser, met niets up te loaden naar een server. gebruik dit programma zonder zorgen!",
      "Nota: Dit programma is geen magie. alleen afbeeldingen gemaakt met deze tool kunnen gedecensureerd worden door deze tool",
      "Home",
      "Censureer",
      "Decensureer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Bestand Openen",
      "(voor Censureeren)",
      "Lettergrootte (in px):",
      "Tekstkleur",
      "Lijnkleur",
      "Lettertype:",
      "Serif",
      "Sans-serif",
      "Monospace",
      "Cursief",
      "Fantasie",
      "Tekst:",
      "Probeer over de afbeelding te gaan!",
      "Zoom lens",
      "Hoe gebruik ik dit programma?",
      "Pixeleer door op de linkermuisknop te drukken of in te houden.",
      "De schaal kan aangepast worden met Shift + Scrolwieltje, of met de slider/input beneden",
      "Je kan je veranderingen ongedaan maken en terug brengen met de knoppen (Ctrl+Z en Ctrl+Y werken ook!)",
      "Je kan de censor \"tool\" ook draaien met Ctrl+Scrolwieltje, of de slider",
      "Je kan een wachtwoord toevoegen, om het te beveiligen van doordringende ogen.",
      "En dan, klik Download op het einde!",
      "Nota: Alle dialogen kunnen bewogen worden door te slepen met de titel.",
      "Toolbox",
      "Voeg afbeeldingen toe!",
      "Draai de Tool",
      "Voeg tekst toe",
      "Schaal the tool!",
      "Zoom:",
      "Uit",
      "Aan",
      "Voeg een wachtwoord toe: ",
      "(Leeg voor geen wachtwoord)",
      "Bestandsnaam:",
      "Ongedaan maken",
      "Terugzetten",
      "Download!",
      "Error",
      "Waarschuwing",
      "Laden",
      "Bestandshandler is gecrashed. Zorg ervoor dat het bestand een efbeelding is die niet grooter is dan 4000x3000 en 50MB. Klik OK om de pagina te herladen.",
      "Bestand is te groot (veilig limiet is 4000x3200). Gebruik niet gegarandeerd. Programma kan instabiel zijn.",
      "Afbeelding heeft al een data payload. Als je verdergaat zal deze data verweiderd worden van de afbeelding.",
      "Bestand is te groot voor deftig te verwerken (50MB limiet). Klik OK om de pagina te herladen.",
      "Gelieve even te wachten tot de afbeelding klaar is. Duur hangt af van de afbeelding en de bewerkte content.",
      "Begrepen!",
      "OK",
      "Klaar",
      "Bestand is geen afbeelding",
      "Er is iets foutgelopen. Gelieve een bug report te maken met de afbeelding die je hebt gebruikt.",
      "Home",
      "Censureer",
      "Decensureer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Bestand Openen",
      "(Voor decensureeren)",
      "Wachtwoord: ",
      "(Leeg voor geen)",
      "Decensureer!",
      "Error",
      "Laden",
      "Bestand is geen afbeelding. Klik OK om de pagina te herladen",
      "Afbeelding niet gegenereerd door BetterCensorship. Klik OK om de pagina te herladen",
      "Fout Wachtwoord. Klik OK om de pagina te herladen",
      "Data Payload Corrupt. Payload kan beveiligd zijn met wachtwoord. Klik OK om de pagina te herladen",
      "Gelieve even te wachten tot de afbeelding klaar is. Duur hangt af van de afbeelding en de bewerkte content.",
      "Versie Mismatch",
      "OK",
      "Home",
      "Censureer",
      "Decensureer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "Download!"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Veelgestelde Vragen",
      "Wat is dit?",
      "BetterCensorship is een nieuw programma dat toestaat om je afbeeldingen te cesureeren in een omdraaibare manier, om censuurwetten te omzeilen in bepaalde staten.",
      "Echt? En wat vraag je voor dit programma?",
      "Niets! Dit programma is compleet gratis, nu en ook in de toekomst.",
      "Hoe maak je dan geld? Sla je de data die we uploaden op en verkoop je die?",
      "We slagen geen enkele vorm van data op. Alles gebeurd in de browser, wat betekend dat er niets word geüpload naar onze servers. Dit project, en de adere dat wij bij Railgun Entertainment maken, word ondersteund door de vriendelijke mensen op onze <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> en <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a>.",
      "Hoe weet ik dat dit programma niet zomaar verdwijnt, en all mijn afbeeldingen niet gedecensureerd kunnen worden?",
      "Dankzij dat dit programma volledig in de browser werkt, kun je de pagina gewoon opslaan (moet geserveerd worden door een webserver, kan lokaal zijn) of maak je eigen service <a href=\"https://github.com/Project-Railgun/BetterCensorship\">met onze code</a>, en het zal blijven werken.",
      "Met welke services werken de afbeeldingen die dit programma genereerd?",
      "Eender welke service dat de afbeeldingen direct opslaagt, in plaats van ze te bewerken, is compatibel met dit. Gekende werkende voorbeelden zijn: Pixiv, DeviantArt, en Discord. Gekende niet werkende voorbeelden zijn: Patreon en Twitter, die de payload weggooien.",
      "Ik kan geen gallerijen van werkende afbeeldingen uploaden op Pixiv.",
      "Op Pixiv, is er een beperking dat gallerijen één bestandstype moeten hebben voor alle afbeeldingen. Je moet aleen PNGs uploaden, en geen JPGs.",
      "Het programma lijkt niet te werken in mijn browser.",
      "Omdat alles gebeurd in de browser in een script, tools dat scripts uitschakelen (Noscript, Brave's script blocking, etc.) breken dit programma.",
      "Home",
      "Censureer",
      "Decensureer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]
