[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Censor Image",
      "Decensor Image",
      "A tool that allows the generation of censored images, with the original image data hidden inside.",
      "Simply use the censorer to generate your image, add a password, and you're off to the races.",
      "To decensor, simply select the image, add in the password and voila, censorship laws bypassed in style!",
      "All of this is done on the client-side, with nothing being uploaded to a backend server. Use this tool worry-free!",
      "Note: This tool isn't magic. Only images censored with this tool, can be decensored by this tool.",
      "Home",
      "Censor",
      "Decensor",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Open File",
      "(For Censoring)",
      "Font Size (in px):",
      "Text Color:",
      "Outline Color:",
      "Font Family:",
      "Serif",
      "Sans-serif",
      "Monospace",
      "Cursive",
      "Fantasy",
      "Text:",
      "Try hovering over the image!",
      "Zoom lens",
      "How do I use this tool?",
      "Pixelate by pressing or holding down your left mouse button.",
      "Scaling can be changed with Shift + Scrollwheel, or the slider/input below",
      "You can undo and redo your changes by pressing the buttons below (Ctrl+Z and Ctrl+Y also work!)",
      "You can also rotate the censor \"tool\" by using Ctrl+Scrollwheel, or the slider",
      "You can add a password to your hidden data, to secure it from prying eyes.",
      "And then, simply press download at the end!",
      "Note: All dialog boxes can be moved by holding the title.",
      "Toolbox",
      "Add more images!",
      "Rotate the Tool",
      "Add Text",
      "Scale the tool!",
      "Zoom:",
      "Off",
      "On",
      "Add a password:\xa0",
      "(Empty field valid option)",
      "Filename:",
      "Undo",
      "Redo",
      "Download!",
      "Error",
      "Warning",
      "Loading",
      "Image handler crashed. Please double check that the file is actually an image no greater than 4000x3000 and 50MB in size. Press OK to reload the page",
      "Image is too large (safe limit is 4000x3200). Usage not guaranteed. Tool may be unstable.",
      "Image already contains a data payload. Proceeding further will remove any such data from the final censored image.",
      "File is too big to be processed properly (50MB Limit). Press OK to reload the page",
      "Please wait while the image processes. Processing time depends upon image size and edited content",
      "Got it!",
      "OK",
      "Done",
      "File not an image",
      "Something went wrong. Please submit a bug report along with any image files you were using.",
      "Home",
      "Censor",
      "Decensor",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Open File",
      "(For Decensoring)",
      "Password:\xa0",
      "(Leave empty if none)",
      "Decensor!",
      "Error",
      "Loading",
      "File is not an Image. Press OK to reload the page",
      "Image not generated by BetterCensorship. Press OK to reload the page",
      "Password Incorrect. Press OK to reload the page",
      "Data Payload Corrupted. Payload may be password protected. Press OK to reload the page",
      "Please wait while the image processes. Processing time depends upon image size and edited content",
      "Version Mismatch",
      "OK",
      "Home",
      "Censor",
      "Decensor",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "Download!"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Frequently Asked Questions",
      "What is this?",
      "BetterCensorship is an innovative new tool that allows you to censor your images simply in a reversible way, to bypass censorship laws in various draconian states.",
      "Really? And what are you charging for this \"tool\"?",
      "Nothing! The tool is completely free, right now and into the future as well.",
      "Then how do you generate profits? Do you store and sell the data that we upload?",
      "We do not store any data whatsoever. The entire codebase is client-sided, meaning that everything happens in your browser, and nothing actually gets uploaded to our servers. This project, and any others that we at Railgun Entertainment develop, have been funded by the nice folk at our <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> and <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a>.",
      "How do I know that this tool won't suddenly disappear, and my images left permanently undecensorable?",
      "Owing to the fact that this tool operates entirely within the browser, with no server calls, you can simply save the page (needs to be served through a webserver, even a local one) or rebuild your own service <a href=\"https://github.com/Project-Railgun/BetterCensorship\">using our code</a>, and it will keep working.",
      "What services do images generated by this tool work on?",
      "Any service that directly stores and displays the images the users upload, instead of modifying them, is compatible with this. Known working examples are Pixiv, DeviantArt and Discord. Known broken examples are Patreon and Twitter, who discard any and all payload data inside images.",
      "I can't seem to upload galleries of images on Pixiv that work properly.",
      "On Pixiv, there is a limitation that galleries must have only one file type for all the images. You must upload only PNGs, and no JPEGs.",
      "The tool doesn't seem to work on my browser.",
      "Because all operations happens client-side inside a script, tools that disable scripts (Noscript, Brave's inbuilt script blocking, etc.) will break the tool.",
      "Home",
      "Censor",
      "Decensor",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]