[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Censurer une image",
      "Décensurer une image",
      "Un outil qui permet de générer des images censurées, avec l'image originale cachée à l'intérieur.",
      "Il suffit d'utiliser le censeur pour générer votre image, d'ajouter un mot de passe et c'est parti.",
      "Pour décensurer, il suffit de sélectionner l'image, d'ajouter le mot de passe et voilà, les lois de censure sont contournées avec style !",
      "Tout cela se fait du côté client, et rien n'est transmis à un serveur distant. Utilisez cet outil sans souci !",
      "Note : Cet outil n'est pas magique. Seules les images censurées avec cet outil, peuvent être décensurées par cet outil.",
      "Accueil",
      "Censurer",
      "Décensurer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Ouvrir un fichier",
      "(À censurer)",
      "Taille du texte (px):",
      "Couleur du texte:",
      "Couleur des contours:",
      "Police:",
      "Serif",
      "Sans-serif",
      "Monospace",
      "Cursive",
      "Fantaisie",
      "Texte:",
      "Essayez de passer la souris sur l'image !",
      "Loupe",
      "Comment utiliser cet outil ?",
      "Pixelisez en appuyant ou en maintenant enfoncé le bouton gauche de votre souris.",
      "La taille peut être modifiée avec Maj+Molette, ou avec le slider/champ dessous.",
      "Vous pouvez annuler et refaire vos modifications en appuyant sur les boutons dessous (Ctrl+Z et Ctrl+Y fonctionnent également !)",
      "Vous pouvez également faire pivoter \"l'outil\" de censure en utilisant Ctrl+Molette ou le slider.",
      "Vous pouvez ajouter un mot de passe à vos données cachées, afin de les protéger des regards indiscrets.",
      "Et puis, il suffit de cliquer sur télécharger à la fin !",
      "Remarque : Toutes les boîtes de dialogue peuvent être déplacées en maintenant leur titre.",
      "Boîte à outils",
      "Ajouter plus d'images !",
      "Faire tourner l'outil",
      "Ajouter du texte",
      "Changez la taille de l'outil !",
      "Zoom:",
      "Off",
      "On",
      "Ajouter un mot de passe: ",
      "(Vous pouvez laisser vide)",
      "Nom du fichier:",
      "Annuler",
      "Refaire",
      "Télécharger !",
      "Erreur",
      "Avertissement",
      "Chargement",
      "Le traitement d'image a planté. Veuillez vérifier que le fichier est bien une image dont la taille ne dépasse pas 4000x3000 et 50 Mo. Appuyez sur OK pour recharger la page",
      "L'image est trop grande (la limite raisonnable est de 4000x3200). Utilisation non garantie. L'outil peut être instable.",
      "L'image contient déjà des données cachées. En continuant, ces données seront supprimées de l'image finale censurée.",
      "Le fichier est trop lourd pour être traité correctement (limite de 50 Mo). Appuyez sur OK pour recharger la page",
      "Veuillez patienter pendant le traitement de l'image. Le temps de traitement dépend de la taille de l'image et du contenu édité",
      "Compris !",
      "OK",
      "Valider",
      "Le fichier n'est pas une image",
      "Un problème est survenu. Veuillez soumettre un rapport de bogue avec les fichiers d'image que vous avez utilisés.",
      "Accueil",
      "Censurer",
      "Décensurer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Ouvrir un fichier",
      "(À décensurer)",
      "Mot de passe: ",
      "(Laissez vide si aucun)",
      "Décensurer !",
      "Erreur",
      "Chargement",
      "Le fichier n'est pas une image. Appuyez sur OK pour recharger la page",
      "Image non générée par BetterCensorship. Appuyez sur OK pour recharger la page",
      "Mot de passe incorrect. Appuyez sur OK pour recharger la page",
      "Données corrompues. Les données peuvent être protégées par un mot de passe. Appuyez sur OK pour recharger la page",
      "Veuillez patienter pendant le traitement de l'image. Le temps de traitement dépend de la taille de l'image et du contenu édité",
      "Différence de version",
      "OK",
      "Accueil",
      "Censurer",
      "Décensurer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "Télécharger !"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Foire Aux Questions",
      "Qu'est-ce que c'est ?",
      "BetterCensorship est un nouvel outil innovant qui vous permet de censurer vos images de manière simple et réversible, afin de contourner les lois de censure de divers États draconiens.",
      "Vraiment ? Et combien facturez vous pour cet \"outil\" ?",
      "Rien ! L'outil est entièrement gratuit, aujourd'hui et dans le futur également.",
      "Alors comment générez-vous des profits ? Stockez-vous et vendez-vous les données que nous transférons ?",
      "Nous ne stockons aucune donnée, quelle qu'elle soit. L'ensemble du code est côté client, ce qui signifie que tout se passe dans votre navigateur et que rien n'est téléchargé sur nos serveurs. Ce projet, et tous les autres que nous développons à Railgun Entertainment, ont été financés par les sympathiques personnes de notre <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> et <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a>.",
      "Comment puis-je savoir que cet outil ne disparaîtra pas soudainement, et que mes images resteront définitivement non décensurable ?",
      "Étant donné que cet outil fonctionne entièrement dans le navigateur, sans recours à un serveur, vous pouvez simplement enregistrer la page (qui doit être servie par un serveur web, même local) ou reconstruire votre propre service <a href=\"https://github.com/Project-Railgun/BetterCensorship\">en utilisant notre code</a>, et il continuera à fonctionner.",
      "Sur quels services fonctionnent les images générées par cet outil ?",
      "Tout service qui stocke et affiche directement les images envoyées par les utilisateurs, au lieu de les modifier, est compatible avec ce système. Les exemples connus qui fonctionnent sont Pixiv, DeviantArt et Discord. Les exemples connus qui ne fonctionnent pas sont Patreon et Twitter, qui rejettent toutes les données utiles à l'intérieur des images.",
      "Je n'arrive pas à téléverser des galeries d'images sur Pixiv qui fonctionnent correctement.",
      "Sur Pixiv, il existe une limitation selon laquelle les galeries doivent avoir un seul type de fichier pour toutes les images. Vous devez téléverser uniquement des PNG, et non des JPEG.",
      "L'outil ne semble pas fonctionner sur mon navigateur.",
      "Étant donné que toutes les opérations se déroulent côté client à l'intérieur d'un script, les outils qui désactivent les scripts (Noscript, le blocage de script intégré à Brave, etc.) vont empêcher l'outil de fonctionner.",
      "Accueil",
      "Censurer",
      "Décensurer",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]
