[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Bild Zensieren",
      "Bild Dezensieren",
      "Ein Werkzeug, welches das Zensieren eines Bildes ermöglicht, mit den Originaldaten versteckt im Bild selbst.",
      "Benutz' einfach das Zensurwerkzeug, um ein Bild zu erstellen, füg' ein Passwort hinzu und los geht's!",
      "Zum Dezensieren wähle das Bild aus, gib' das Passwort ein und voilà das Zensurgesetz wurde erfolgreich hintergangen!",
      "All das funktioniert client-side, ohne upload auf einen backend Server. Mach' dir also keine Sorgen!",
      "Also: Das ist keine Hexerei. Nur mit diesem Werkzeug zensierte Bilder können auch hiermit dezensiert werden.",
      "Home",
      "Zensieren",
      "Dezensieren",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Datei Öffnen",
      "(Zum Zensieren)",
      "Schriftgröße (in px):",
      "Textfarbe:",
      "Rahmenlinienfarbe:",
      "Schriftart:",
      "Serif",
      "Sans-serif",
      "Monospace",
      "Kursiv",
      "Fantasy",
      "Text:",
      "Versuch über das Bild zu hovern!",
      "Linsenzoom",
      "Wie verwende ich dieses Werkzeug?",
      "Verpixle, indem du die linke Maustaste drückst oder gedrückt hältst.",
      "Die Skalierung kann mit Shift + Mausrad, oder dem Schieberegler darunter geändert werden",
      "Du kannst deine Änderungen mit den untenstehenden Tasten rückgängig machen und wiederherstellen (Strg+Z and Strg+Y funktionieren auch!)",
      "Du kannst das Zensierte auch rotieren, \"tool\" indem du Strg+Mausrad, oder die Schieberegler benutzt",
      "Du kannst ein Passwort festlegen, um deine Dateiinformationen zu sichern.",
      "Danach musst du nurmehr auf Download klicken",
      "Man beachte: Alle Dialogfelder können mit klich auf den Titel bewegt werden.",
      "Toolbox",
      "Mehr Bilder hinzufügen!",
      "Werkzeug drehen",
      "Text hinzufügen",
      "Werkzeug skalieren",
      "Zoom:",
      "Aus",
      "An",
      "Passwort hinzufügen: ",
      "(Leeres Feld ist eine valide Option)",
      "Dateiname:",
      "Zurücksetzen",
      "Wiederherstellen",
      "Download!",
      "Fehler",
      "Warnung",
      "Laden",
      "Der Bildhandler ist gecrashed. Bitte überprüfe, ob die Datei tatsächlich ein Bild, welches nicht größer als 4000x3000 und 50MB ist. Klicke auf OK um die Seite neu zu laden",
      "Bild ist zu groß (Das sichere Limit ist 4000x3200). Verwendbarkeit nicht garantiert. Werkzeug kann instabil sein.",
      "Bild enthält bereits Dateiinformationen. Weiter fortzufahren wird jegliche Information aus dem finalen Bild entfernen.",
      "Datei ist zu groß! (50MB Limit). Klick' auf OK, um die Seite neu zu laden",
      "Bitte warten, währen das Bild generiert. Die Dauer hängt von Bildgröße und geänderten Attributen ab",
      "Fertig!",
      "OK",
      "Fertig",
      "Datei ist kein Bild!",
      "Da ist etwas schiefgelaufen. Bitte reiche einen Bugreport mit den verwendeten Bildern ein.",
      "Home",
      "Zensieren",
      "Dezensieren",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Datei öffnen",
      "(Zum Dezensieren)",
      "Passwort: ",
      "(Wenn nicht vorhanden, Feld freilassen)",
      "Dezensieren!",
      "Fehler",
      "Laden",
      "Datei ist kein Bild. Klick' auf OK, um die Seite neu zu laden",
      "Bild wurde nicht von BetterCensorship generiert. Klick' auf OK, um die Seite neu zu laden",
      "Falsches Passwort. Klick' auf OK, um die Seite neu zu laden",
      "Dateiinformationen fehlerhaft. Dateiinformationen könnten passwortgeschützt sein. Klick' auf OK, um die Seite neu zu laden",
      "Bitte warten, während der Prozess läuft. Die Dauer hängt von Bildgröße und geänderten Attributen ab",
      "Versionen stimmen nicht überein",
      "OK",
      "Home",
      "Zensieren",
      "Dezensieren",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "Download!"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Frequently Asked Questions",
      "Was ist das?",
      "BetterCensorship ein innovatives Werkzeug, welches dir erlaubt, Bilder auf einem einfachen, wiederherstellbaren Weg zu zensiern, um Zensurgesetze in diversen Ländern zu umgehen.",
      "Ach wirklich? Und was bekommst du dafür bezahlt \"tool\"?",
      "Gar nichts! Das Werkzeug ist und wird auch in Zukunft gratis bleiben.",
      "Und wie machst du dann Gewinn? Verscherbelst du da einfach meine ganzen Daten?",
      "Wir wollen überhaupt keine Daten verkaufen. Der ganze Code ist client-sided, was bedeutet, dass alles was in deinem Browser passiert dort auch bleibt und nichts an unsere Server weitergeleitet wird. Dieses und alle anderen Projekte von Railgun Entertainment wurden komplett von unseren Freunden auf <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> and <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a> finanziert.",
      "Woher weiß ich, dass dieses Werkzeug auch in Zukunft funktioniert und ich meine zensierten bilder nicht mehr dezensieren kann?",
      "Zusätzlich zur Client-Side Basis und ohne Server-Calls, kannst du die Seite auch einfach speichern, oder das Ganze nochmal selber in die Hand nehmen <a href=\"https://github.com/Project-Railgun/BetterCensorship\">using our code</a>.",
      "Wie steht es mit Kompabilität zu anderen ähnlichen Services?",
      "Jeder Service welcher hochgeladene Dateien, ohne sie zu bearbeiten, direkt speichert, ist kompatibel. Einige Beispiele sind Pixiv, DeviantArt und Discord. Nicht funktionierende sind Patreon and Twitter, welche alle gespeicherten Dateiinformationen entfernen.",
      "Ich kann keine funitionierenden Bildgalerien auf Pixiv hochladen.",
      "Auf Pixiv gibt es folgende Anforderung welche Galerien benötigen: Es darf nur einen Dateitypen für alle Bilder geben. Du darfst also nur PNGs, und keine JPEGs hochladen.",
      "Das Werkzeug funktioniert nicht in meinem Browser.",
      "Da alles client-side über ein Script läuft, können das manche Scriptblocker in deinem Browser blockieren (Noscript, Brave's inbuilt script blocking, etc.).",
      "Home",
      "Zensieren",
      "Dezensieren",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]
