[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Censura un'immagine",
      "Decensura un'immagine",
      "Uno strumento che permette la generazione di immagini censurate, mantenendo l'immagine originale nascosta all'interno.",
      "Usa semplicemente l'opzione di censura per censurare un'immagine, aggiungi una password ed hai fatto!.",
      "Per decensurare un'immagine, seleziona semplicemente l'immagine, inserisci la password e voilá, abbiamo bypassato le leggi di censura con stile!",
      "Tutto questo viene eseguito client-side, senza che nulla venga inviato ad un server back-end. Sentiti libero di usare questo tool senza preoccuparti!",
      "Nota: Questo tool non è magico. Solo le immagini censurate con questo tool, possono essere decensurate con questo tool.",
      "Home",
      "Censura un'immagine",
      "Decensura un'immagine",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Apri un file",
      "(per censurarlo)",
      "Dimensione Font (in px):",
      "Colore Testo:",
      "Colore Outline:",
      "Famiglia Font:",
      "Serif",
      "Sans-serif",
      "Monospazio",
      "Corsivo",
      "Fantasy",
      "Testo:",
      "Prova a muovere il mouse sopra l'immagine!",
      "Lente d'ingrandimento",
      "Come si usa questo tool?",
      "Pixella un'immagine premendo o tenendo premuto il tasto sinistro del mouse.",
      "Lo scaling può essere cambiato usando Shift + Rotellina del mouse, cambiando la posizione dello slider o il suo valore nella toolbox",
      "Puoi annullare o riapplicare le tue modifiche premendo i rispettivi pulsanti nella toolbox (Ctrl+Z e Ctrl+Y funzionano anche!)",
      "Puoi anche ruotare il censor \"tool\" utilizzando Ctrl + Rotellina del mouse, o lo slider",
      "Puoi aggiungere una password ai tuoi dati nascosti, per tenerli al sicuro da occhi indiscreti.",
      "Una volta finito, premi il tasto download!",
      "Nota: Tutte le finestre di dialogo possono essere spostate, trascinandole dal loro titolo.",
      "Toolbox",
      "Aggiungi altre immagini!",
      "Ruotazione del Tool",
      "Agggiungi Testo",
      "Scala del tool!",
      "Zoom:",
      "Off",
      "On",
      "Aggiungi una password: ",
      "(il campo può rimanere vuoto)",
      "Nome del file:",
      "Annulla",
      "Riapplica",
      "Download!",
      "Errore",
      "Attenzione",
      "Caricamento",
      "Il gestore delle immagini è crashato. Per favore controlla che il file non sia in uso e che sia un'immagine non più grande di 4000x3000 pixel e 50MB. Premi OK per ricaricare la pagina",
      "L'immagine è troppo grande (il limite garantito è di 4000x3200). Le funzionalità non sono garantite. Il Tool potrebbe essere instabile.",
      "L'immagine contiene già un payload di dati. Procedere ulteriormente rimuoverà qualsiasi dato originale dall'immagine risultante.",
      "Il file è troppo grande per essere processato correttamente (Limite 50MB). Premi OK per ricaricare la pagina",
      "Attendere che l'immagine venga processata. Il tempo richiesto dipende dalla dimensione dell'immagine e del contenuto modificato",
      "Ho capito!",
      "OK",
      "Fatto",
      "Il file non è un'immagine",
      "Qualcosa è andato storto. Ti preghiamo di inviarci un bug report insieme ai file immagine che stavi usando.",
      "Home",
      "Censura un'immagine",
      "Decensura un'immagine",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Apri un file",
      "(per decensurarlo)",
      "Password: ",
      "(lasciare vuoto se non necessario)",
      "Decensura!",
      "Errore",
      "Caricamento",
      "Il file non è un'immagine. Premi OK per ricaricare la pagina",
      "Immagine non generata da BetterCensorship. Premi OK per ricaricare la pagina",
      "Password sbagliata. Premi OK per ricaricare la pagina",
      "Payload Dati Corrotto. Il payload potrebbe essere protetto da password. Premi OK per ricaricare la pagina",
      "Attendere che l'immagine venga processata. Il tempo richiesto dipende dalla dimensione dell'immagine e del contenuto modificato",
      "Versione non corrispondente",
      "OK",
      "Home",
      "Censura un'immagine",
      "Decensura un'immagine",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "Download!"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Frequently Asked Questions",
      "Cos'è questo tool?",
      "BetterCensorship è un nuovo ed innovativo tool che ti permette di censurare le tue immagini in modo semplice e innovativo, permettendo sempre di ritornare all'immagine originale, ideato per bypassare le leggi di censura in vari stati draconici.",
      "Davvero? E quanto costa questo \"tool\"?",
      "Nulla! Il tool è completamente gratuito, già da adesso e per il futuro.",
      "Quindi come ne traete profitto? Conservate e vendete i dati che uploadiamo?",
      "Non conserviamo nessun dato. L'intera codebase è client-side, ciò significa che tutto viene eseguito in locale sul tuo browser e niente viene caricato sul nostro server. Questo ed altri progetti, che sviluppiamo alla Railgun Entertainment development, sono stati finanziati grazie ai nostri supporter su <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> e <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a>.",
      "Come faccio a sapere che questo tool non sparirà all'improvviso e che le mie immagini non rimangano permanentemente censurate?",
      "Dato che questo tool lavora interamente sul tuo browser, senza chiamate al server, puoi semplicemente salvarti la pagina (ha bisogno di essere servita tramite un webserver, anche uno locale), oppure puoi ricostruirti il servizio <a href=\"https://github.com/Project-Railgun/BetterCensorship\">utilizzando il nostro codice</a>, e continuerà a funzionare.",
      "Su quali servizi funzionano le immagini generate tramite questo tool?",
      "Qualsiasi servizio che immagazzina e mostra le immagini caricate dagli utenti direttamente, senza modificarle, è compatibile. Servizi testati e funzionanti sono: Pixiv, DeviantArt e Discord. Non funzionano invece: Patreon and Twitter, i quali rimuovono qualsiasi payload all'interno delle immagini.",
      "Non riesco a fare in modo che le gallerie di immagini che carico su Pixiv funzionino con il tool.",
      "Su Pixiv, c'è una limitazione per cui le gallerie di immagini, devono essere formate da un singolo tipo di immagine, per tutte le immagini. Devi caricare solo file PNG e nessun JPEG.",
      "Il tool non sembra funzionare nel mio browser.",
      "Siccome tutte le operazioni avvengono client-side tramite uno script, i tool che disabilitano gli script (Noscript, lo script-block integrato su Brave, ecc.) renderanno impossibile fan funzionare il tool.",
      "Home",
      "Censura un'immagine",
      "Decensura un'immagine",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]