[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Censurar Imagen",
      "Quitar Censura a Imagen",
      "Herramienta que permite la generación de imágenes censuradas con los datos de la imagen original ocultos en ellos.",
      "Simplemente usa el censurador para generar su imagen, agregue una contraseña y listo.",
      "Para eliminar la censura, simplemente seleccione la imagen, agregue la contraseña y listo!",
      "Todo esto se hace en el lado del cliente, sin que nada se cargue en un servidor backend. ¡Puedes usarlo sin preocupaciones!",
      "Nota: Esta herramienta no es mágica. Solo las imágenes censuradas con esta herramienta pueden ser removidas de censura por esta herramienta.",
      "Página principal",
      "Censurar",
      "Quitar Censura",
      "Preguntas Frecuentes",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Abrir Archivo",
      "(Para censurar)",
      "Tamaño de Fuente (en px):",
      "Color de Texto:",
      "Color del Contorno:",
      "Tipo de Fuente:",
      "Serif",
      "Sans-serif",
      "Monoespaciado",
      "Cursivo",
      "Fantasía",
      "Texto:",
      "Prueba pasar el cursor encima!",
      "Lente de Zoom",
      "¿Cómo usar esta herramienta?",
      "Censura presionando o manteniendo presionado el botón izquierdo del mouse.",
      "El tamaño de la censura puede ser cambiado con Shift + Rueda del mouse, o el slider de abajo.",
      "Puede deshacer y rehacer sus cambios presionando los botones de abajo (¡Ctrl+Z y Ctrl+Y también funcionan!)",
      "También puede rotar la \"herramienta\" de censura usando Ctrl + Rueda del mouse, o el slider",
      "Puedes agregar una contraseña a los datos de la censura, para asegurarlo contra otros.",
      "Luege solo, simplemente presiona descargar al final!",
      "Nota: Todos los cuadros de diálogo se pueden mover manteniendo presionado el título.",
      "Herramientas",
      "Agrega más imágenes!",
      "Rota la herramienta",
      "Agrega texto",
      "Escala la herramienta!",
      "Zoom:",
      "Off",
      "On",
      "Agrega una contraseña: ",
      "(Dejarlo en blanco es válido)",
      "Nombre del archivo:",
      "Deshacer",
      "Rehacer",
      "Descargar!",
      "Error",
      "Advertencia",
      "Cargando",
      "El controlador de imágenes se bloqueó. Vuelva a verificar que el archivo sea una imagen de no más de 4000x3000 y 50 MB de tamaño. Presiona OK para recargar la página.",
      "La imagen es demasiado grande (el límite seguro es 4000x3200). No garantizado. La herramienta puede ser inestable.",
      "La imagen ya contiene datos de censura. Si continúa, se eliminarán dichos datos de la imagen censurada final.",
      "El archivo es demasiado grande para procesarlo correctamente (el límite es de 50 MB). Presiona OK para recargar la página.",
      "Espere mientras se procesa la imagen. El tiempo de procesamiento depende del tamaño de la imagen y del contenido editado",
      "Entendido!",
      "OK",
      "Hecho",
      "El archivo no es una imagen",
      "Algo salió mal. Envíe un informe de error junto con los archivos que estaba usando",
      "Página principal",
      "Censurar",
      "Quitar Censura",
      "Preguntas Frecuentes",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Abrir archivo",
      "(Para quitar censura)",
      "Contraseña: ",
      "(Dejar en blanco si no pusiste algo)",
      "Quitar Censura!",
      "Error",
      "Cargando",
      "El archivo no es una imagen. Presiona OK para recargar la página",
      "Imagen no generada por BetterCensorship. Presiona OK para recargar la página",
      "Contraseña incorrecta. Presiona OK para recargar la página",
      "Datos de censura corruptos. Los datos de censura pueden estar protegida con contraseña. Presiona OK para recargar la página",
      "Espere mientras se procesa la imagen. El tiempo de procesamiento depende del tamaño de la imagen y del contenido editado",
      "La version no coincide",
      "OK",
      "Página principal",
      "Censurar",
      "Quitar Censura",
      "Preguntas Frecuentes",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "Descargar!"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Preguntas frecuentes",
      "¿Que es esto?",
      "BetterCensorship es una herramienta nueva que le permite censurar sus imágenes de forma reversible, para eludir las leyes de censura en varios estados draconianos",
      "¿En serio? ¿Y cuánto estás cobrando por esta \"herramienta\"?",
      "¡Nada! La herramienta es completamente gratuita, ahora y en el futuro también.",
      "Entonces, ¿cómo generar ganancias? ¿Guardas y vendes los datos que subimos?",
      "No almacenamos ningún tipo de datos. Todo el código base está del lado del cliente, lo que significa que todo sucede en su navegador y nada se carga en nuestros servidores. Este proyecto, y cualquier otro que desarrollemos en Railgun Entertainment, ha sido financiado por la buena gente de nuestro <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> y <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a>.",
      "¿Cómo sé que esta herramienta no desaparecerá repentinamente y mis imágenes quedarán permanentemente sin censurar?",
      "Debido al hecho de que esta herramienta funciona completamente dentro del navegador, sin llamadas al servidor, simplemente puede guardar la página (debe ser servida a través de un servidor web, incluso uno local) o reconstruir su propio servicio <a href=\"https ://github.com/Project-Railgun/BetterCensorship\">usando nuestro código</a>, y seguirá funcionando.",
      "¿Sobre qué servicios funcionan las imágenes generadas por esta herramienta?",
      "Cualquier servicio que almacene y muestre directamente las imágenes que suben los usuarios en lugar de modificarlas, es compatible con ellos. Los ejemplos conocidos que funcionan son Pixiv, DeviantArt y Discord. Los ejemplos conocidos que no funcionan son Patreon y Twitter, que quitan todos y cada uno de los datos de censura dentro de las imágenes.",
      "Parece que no puedo subir galerías de imágenes en Pixiv que funcionen correctamente",
      "En Pixiv, existe una limitación de que las galerías deben tener un solo tipo de archivo para todas las imágenes. Debe subir solo archivos PNG y no archivos JPEG.",
      "La herramienta no parece funcionar en mi navegador.",
      "Debido a que todas las operaciones ocurren del lado del cliente en un script, herramientas que deshabilitan los scripts (Noscript, incorporado en Brave, etc.) romperan la herramienta.",
      "Página principal",
      "Censurar",
      "Quitar Censura",
      "Preguntas Frecuentes",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]